Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

Ans =

In [1]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
df = pd.read_csv("services1.csv")

In [3]:
df.head()

,id,location_id,data,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,1.0,1.0,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,2.0,8.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,3.0,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,4.0,16.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,5.0,23.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
df[['data']]

    data
0    4.0
1    8.0
2   15.0
3   16.0
4   23.0
5   42.0
6    NaN
7    NaN
8    NaN
9    NaN
10   NaN
11   NaN
12   NaN
13   NaN
14   NaN
15   NaN
16   NaN
17   NaN
18   NaN
19   NaN
20   NaN
21   NaN
22   NaN

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [25]:
x = pd.Series([10, 20, 30, 40, 50,60,70,80,90,100], index =['a', 'b', 'c', 'd', 'e','f','g','h','i','j'])

In [26]:
print (x)

a     10
b     20
c     30
d     40
e     50
f     60
g     70
h     80
i     90
j    100
dtype: int64

In [27]:
type(x)

pandas.core.series.Series

Q3. Create a Pandas DataFrame that contains the following data:
    Name         Age               Gender
    Alice        25                Female
    Bob          30                Male
    Claire       27                Female
Then, print the DataFrame.

In [1]:
import pandas as pd

In [2]:
df2 = pd.read_csv("services4.csv")

In [3]:
df2.head()

     name  age  gender
0  Alice    25  Female
1    Bob    30    Male
2  Claire   27  Female

In [4]:
type(df2)

pandas.core.frame.DataFrame

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Ans = A datafram is a two dimentional data structure which is designed for handling tabular data with multiple columns,while a series is a one dimentional data structure uesed to represent a single column or row of data within a dataframe or as a standalone data structure.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans= we can use some common functions use to manupulate data in a pandas dataframe which is -

.head()
.tail()
.read_csv()
.columns
.dtypes

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans= In pandas, Series and DataFrame are both value mutable. this mean that we can change the value within a Series or DataFrame without creating a new object,we can not change the size of Series.
a panel is a three dimentional data structure and it is also mutable we can change also the size of a panel

In [6]:
import pandas as pd

In [7]:
s = pd.Series([1,2,3,4])
# create a series

In [8]:
s[0]=5
# chage the value of index 0

In [9]:
s

0    5
1    2
2    3
3    4
dtype: int64

In [12]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

In [13]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [16]:
df.loc[0,'A']=7
# Change the value at row 0, column 0

In [17]:
df

   A  B
0  7  4
1  2  5
2  3  6

Q7. Create a DataFrame using multiple Series. Explain with an example.
Ans=

In [22]:
import pandas as pd
a = [1,2,3,4,5]
b = [5,6,7,8,9]

frm1 = pd.Series('a')
frm2 = pd.Series('b')


d_frame = {'frm1':a,
          'frm2':b}

result = pd.DataFrame(d_frame)

In [23]:
result

   frm1  frm2
0     1     5
1     2     6
2     3     7
3     4     8
4     5     9